app/controllers/articles_controller.rb

  def update
    article = Article.find(params[:id])
    article.update(title:params[:article][:title], description:params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-12-15 16:14:00.433619"], ["id", 1]]